Update ideas.md
